## <center><h1 style="color:red">Map of Science</h1></center> 
### Solución del deber
#### Bioinformatica 
#### Nombre: Samantha Guiñanzaca
#### Grupo 1 
 * Basado en las sesiones de Visualización de datos y Expresiones resulares. Realice una adaptación de la solución del MAP OF SCIENCE. *

### Importar módulos

In [3]:
import re
import csv
import pandas as pd
import matplotlib.pyplot as pltb
import itertools

In [4]:
with open('./pubmed_MEG3incanc_set.txt','r', encoding ='utf-8-sig') as f:
    texto = f.read()

In [5]:
texto1 = re.findall(r"\,\s[A-Z]+[A-z]{2,11}\.", texto)

In [11]:
unique_text =list(set(texto1))
unique_text.sort()
a = unique_text
print(a[:50])

[', Argentina.', ', Australia.', ', Austria.', ', Basel.', ', Belgium.', ', Brazil.', ', Canada.', ', China.', ', Denmark.', ', Egypt.', ', France.', ', Germany.', ', Greece.', ', Hungary.', ', Iceland.', ', Illinois.', ', Inc.', ', India.', ', Iran.', ', Iraq.', ', Italy.', ', Japan.', ', Junko].', ', Korea.', ', Latvia.', ', Lithuania.', ', Ltd.', ', Maryland.', ', Mexico.', ', Michigan.', ', Netherlands.', ', Norway.', ', Ohio.', ', Pakistan.', ', Poland.', ', Romania.', ', Russia.', ', Singapore.', ', Spain.', ', Sweden.', ', Switzerland.', ', Taiwan.', ', Tex.', ', USA.']

In [12]:
b = unique_text
b.remove(', Basel.')
b.remove(', Illinois.')
b.remove(', Inc.')
b.remove(', Junko].')
b.remove(', Ltd.')
b.remove(', Maryland.')
b.remove(', Michigan.')
b.remove(', Ohio.')
b.remove(', Tex.')

In [13]:
print() 
print('Lista de países: ', b)

Lista de países:  [', Argentina.', ', Australia.', ', Austria.', ', Belgium.', ', Brazil.', ', Canada.', ', China.', ', Denmark.', ', Egypt.', ', France.', ', Germany.', ', Greece.', ', Hungary.', ', Iceland.', ', India.', ', Iran.', ', Iraq.', ', Italy.', ', Japan.', ', Korea.', ', Latvia.', ', Lithuania.', ', Mexico.', ', Netherlands.', ', Norway.', ', Pakistan.', ', Poland.', ', Romania.', ', Russia.', ', Singapore.', ', Spain.', ', Sweden.', ', Switzerland.', ', Taiwan.', ', USA.']

In [14]:
    c = "".join(b)
    d = c.split(", ")
    e = "".join(d)
    f = e.split(".")
    f.remove("")
    g = f
    print()
    print('Lista def paises definitiva: ', g)

Lista def paises definitiva:  ['Argentina', 'Australia', 'Austria', 'Belgium', 'Brazil', 'Canada', 'China', 'Denmark', 'Egypt', 'France', 'Germany', 'Greece', 'Hungary', 'Iceland', 'India', 'Iran', 'Iraq', 'Italy', 'Japan', 'Korea', 'Latvia', 'Lithuania', 'Mexico', 'Netherlands', 'Norway', 'Pakistan', 'Poland', 'Romania', 'Russia', 'Singapore', 'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'USA']

In [15]:
data = pd.read_csv('./Paises_ubicacion.csv', engine='python', skipfooter=3)
data.head(10)

  country   latitude  longitude                  name
0      AD  42.546245   1.601554               Andorra
1      AE  23.424076  53.847818  United Arab Emirates
2      AF  33.939110  67.709953           Afghanistan
3      AG  17.060816 -61.796428   Antigua and Barbuda
4      AI  18.220554 -63.068615              Anguilla
5      AL  41.153332  20.168331               Albania
6      AM  40.069099  45.038189               Armenia
7      AN  12.226079 -69.060087  Netherlands Antilles
8      AO -11.202692  17.873887                Angola
9      AQ -75.250973  -0.071389            Antarctica

In [16]:
name = data[data.name.isin(g)]
name.head(10)

   country   latitude   longitude         name
10      AR -38.416097  -63.616672    Argentina
12      AT  47.516231   14.550072      Austria
13      AU -25.274398  133.775136    Australia
19      BE  50.503887    4.469936      Belgium
28      BR -14.235004  -51.925280       Brazil
35      CA  56.130366 -106.346771       Canada
40      CH  46.818188    8.227512  Switzerland
45      CN  35.861660  104.195397        China
53      DE  51.165691   10.451526      Germany
55      DK  56.263920    9.501785      Denmark

In [17]:
paises = data[data.country.isin(g)]
all_data =pd.concat([name,paises]).drop_duplicates().sort_values('name')
all_data.head(10)

   country   latitude   longitude       name
10      AR -38.416097  -63.616672  Argentina
13      AU -25.274398  133.775136  Australia
12      AT  47.516231   14.550072    Austria
19      BE  50.503887    4.469936    Belgium
28      BR -14.235004  -51.925280     Brazil
35      CA  56.130366 -106.346771     Canada
45      CN  35.861660  104.195397      China
55      DK  56.263920    9.501785    Denmark
61      EG  26.820553   30.802498      Egypt
71      FR  46.227638    2.213749     France